Updated docs to use mermaid
